Tekla Open API Reference for Tekla Structures 2025
UserPropertyItem.GetObjectTypes Method
 Gets the object types which contain this user property item.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool GetObjectTypes(
	ref List<CatalogObjectTypeEnum> objectTypes
)
Public Function GetObjectTypes (
	ByRef objectTypes As List(Of CatalogObjectTypeEnum)
) As Boolean
Parameters
objectTypes
Type: System.Collections.Generic.List<CatalogObjectTypeEnum>
The object types that were gotten.
Return Value
Type: Boolean
True on success.
See Also
Reference
UserPropertyItem Class
Tekla.Structures.Catalogs Namespace